Revit 2027 API
ExternalService.NumberOfServers Property
 Indicates the number of servers currently registered with the service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfServers { get; }
Public ReadOnly Property NumberOfServers As Integer
	Get
public:
property int NumberOfServers {
	int get ();
}
member NumberOfServers : int with get
Property Value
Int32
Remarks
 This is the muber of all registered servers, not just of the ones that are currently active.
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace